<a href="https://colab.research.google.com/github/carolvieirav/Case_CloudWalk/blob/main/DesafioCloudWalk.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
data = pd.read_csv('https://gist.githubusercontent.com/cloudwalk-tests/76993838e65d7e0f988f40f1b1909c97/raw/9ceae962009236d3570f46e59ce9aa334e4e290f/transactional-sample.csv')

In [3]:
data.head()

   transaction_id  merchant_id  user_id  ... transaction_amount device_id  has_cbk
0        21320398        29744    97051  ...             374.56  285475.0    False
1        21320399        92895     2708  ...             734.87  497105.0     True
2        21320400        47759    14777  ...             760.36       NaN    False
3        21320401        68657    69758  ...            2556.13       NaN     True
4        21320402        54075    64367  ...              55.36  860232.0    False

[5 rows x 8 columns]

In [4]:
data.info() # Column device_id is the only one with missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3199 entries, 0 to 3198
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   transaction_id      3199 non-null   int64
 1   merchant_id         3199 non-null   int64
 2   user_id             3199 non-null   int64
 3   card_number         3199 non-null   object
 4   transaction_date    3199 non-null   object
 5   transaction_amount  3199 non-null   float64
 6   device_id           2369 non-null   float64
 7   has_cbk             3199 non-null   bool
dtypes: bool(1), float64(2), int64(3), object(2)
memory usage: 178.2+ KB

#Data Pre-processing

In [5]:
data.transaction_date.head()

0    2019-12-01T23:16:32.812632
1    2019-12-01T22:45:37.873639
2    2019-12-01T22:22:43.021495
3    2019-12-01T21:59:19.797129
4    2019-12-01T21:30:53.347051
Name: transaction_date, dtype: object

In [8]:
# splitting date and time information
date_array = np.array(data['transaction_date'])
for i in date_array:
  date = np.array((re.split('T', i)))

# integrating transformed date into data frame
data['transaction_date'] = date[0] 
data['transaction_time'] = date[1]

In [10]:
data.head()

   transaction_id  merchant_id  user_id  ... device_id has_cbk  transaction_time
0        21320398        29744    97051  ...  285475.0   False   01:27:15.811098
1        21320399        92895     2708  ...  497105.0    True   01:27:15.811098
2        21320400        47759    14777  ...       NaN   False   01:27:15.811098
3        21320401        68657    69758  ...       NaN    True   01:27:15.811098
4        21320402        54075    64367  ...  860232.0   False   01:27:15.811098

[5 rows x 9 columns]

#Exploratory Analysis

In [17]:
len(data.user_id)

3199

In [18]:
len(data.user_id.unique())

2704

In [20]:
data.head()

   transaction_id  merchant_id  user_id  ... device_id has_cbk  transaction_time
0        21320398        29744    97051  ...  285475.0   False   01:27:15.811098
1        21320399        92895     2708  ...  497105.0    True   01:27:15.811098
2        21320400        47759    14777  ...       NaN   False   01:27:15.811098
3        21320401        68657    69758  ...       NaN    True   01:27:15.811098
4        21320402        54075    64367  ...  860232.0   False   01:27:15.811098

[5 rows x 9 columns]

In [31]:
data.duplicated(subset=['merchant_id','card_number','transaction_date','transaction_amount','device_id']).unique() #checking for duplicated rows

array([False])